-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2025-02-27 18:56:02
-- 伺服器版本： 10.4.32-MariaDB
-- PHP 版本： 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `daiski_db`
--

-- --------------------------------------------------------

--
-- 資料表結構 `coupon`
--

CREATE TABLE `coupon` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(20) NOT NULL,
  `code` varchar(20) NOT NULL,
  `startAt` date NOT NULL,
  `endAt` date NOT NULL,
  `usageLimit` int(11) NOT NULL,
  `minPurchase` int(11) NOT NULL,
  `createdAt` datetime NOT NULL,
  `type_id` int(11) NOT NULL,
  `coupon_target_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `coupon`
--

INSERT INTO `coupon` (`id`, `name`, `code`, `startAt`, `endAt`, `usageLimit`, `minPurchase`, `createdAt`, `type_id`, `coupon_target_id`) VALUES
(1, '冰雪狂歡券', 'GDVkpAWwPblj', '2025-02-28', '2025-03-15', 300, 3000, '2025-02-27 18:06:27', 22, 1),
(2, '滑雪之星券', 'eaIFI8i8s5EP', '2025-03-07', '2025-03-13', 300, 5000, '2025-02-27 18:06:52', 27, 3),
(3, '冰峰特惠券', 'HQEWIdtOCkUi', '2025-03-13', '2025-03-21', 350, 3450, '2025-02-27 18:07:16', 22, 2),
(4, '雪韻優惠券', 'ofGwJqactVfM', '2025-03-11', '2025-03-20', 100, 1000, '2025-02-27 18:07:43', 12, 1),
(5, '極速滑雪券', '_GCtLNjZb_-L', '2025-02-28', '2025-03-20', 250, 1500, '2025-02-27 18:08:08', 14, 2),
(6, '雪地狂飆券', 'Jqc7VUduTN1Y', '2025-03-13', '2025-03-20', 100, 2500, '2025-02-27 18:08:33', 15, 2),
(7, '極限滑行券', 'jMvFPHcvtawd', '2025-03-14', '2025-03-21', 100, 1600, '2025-02-27 18:08:54', 19, 3),
(8, '冰川冒險券', 'jyZEpevdaR7t', '2025-03-13', '2025-03-26', 100, 550, '2025-02-27 18:09:30', 22, 2),
(9, '雪原探險券', 'Xh_zw1uTFKkE', '2025-02-28', '2025-03-20', 250, 2500, '2025-02-27 18:09:57', 15, 2),
(10, '冰封奇遇券', '3ZMKYz-WrrYv', '2025-03-14', '2025-03-26', 125, 1250, '2025-02-27 18:10:21', 20, 2),
(11, '冰雪狂歡券', '3Ym1bBNd_zSr', '2025-03-06', '2025-03-14', 350, 4000, '2025-02-27 18:10:49', 1, 2),
(12, '滑雪之星券', 'n8WUD7FDKiLz', '2025-02-28', '2025-03-13', 150, 2500, '2025-02-27 18:11:12', 13, 2),
(13, '冰峰特惠券', 'rcE66Yr0aut7', '2025-02-28', '2025-03-05', 100, 500, '2025-02-27 18:11:36', 14, 3),
(14, '雪韻優惠券', 'f92ynsvIXT5C', '2025-03-07', '2025-03-12', 200, 500, '2025-02-27 18:12:04', 12, 2),
(15, '極速滑雪券', 'tqco4W0MpatZ', '2025-02-28', '2025-03-18', 400, 1000, '2025-02-27 18:12:34', 22, 2),
(16, '雪地狂飆券', '4gfxwRcSDZuO', '2025-03-06', '2025-03-20', 200, 2500, '2025-02-27 18:12:56', 1, 2),
(17, '極限滑行券', 'G4k4--dRINh3', '2025-02-28', '2025-03-20', 50, 5000, '2025-02-27 18:13:20', 28, 3),
(18, '冰川冒險券', 'N9agsCustUWx', '2025-03-11', '2025-03-21', 300, 1500, '2025-02-27 18:13:45', 15, 2),
(19, '雪原探險券', 'bFfHGjpT-RCd', '2025-02-28', '2025-03-13', 350, 3500, '2025-02-27 18:14:07', 22, 1),
(20, '冰封奇遇券', 'SpugnW4uPOCg', '2025-02-28', '2025-03-15', 350, 2500, '2025-02-27 18:14:47', 29, 2),
(21, '冰雪樂活券', 'uw-tyTUZqN0y', '2025-03-05', '2025-03-14', 300, 2500, '2025-02-27 18:15:47', 1, 3),
(22, '冰雪狂歡券', 'ZHzBqkKWvVzi', '2025-03-04', '2025-03-14', 350, 2500, '2025-02-27 18:16:23', 15, 2),
(23, '冰雪樂活券', 'YaKg23EdgE2j', '2025-02-28', '2025-03-20', 300, 2500, '2025-02-27 18:16:47', 22, 3),
(24, '滑雪狂熱券', 'qw5nWvG_9kq7', '2025-02-28', '2025-03-20', 350, 2500, '2025-02-27 18:17:11', 15, 1),
(25, '滑雪狂熱券', 'opG7HXpijrjn', '2025-02-28', '2025-03-15', 300, 3000, '2025-02-27 18:17:31', 10, 1),
(26, '雪域探險券', '_s9nGbFs5PLZ', '2025-03-08', '2025-03-12', 200, 500, '2025-02-27 18:17:57', 18, 2),
(27, '雪域探險券', 'r0QMrbCSNd18', '2025-03-05', '2025-03-12', 350, 100, '2025-02-27 18:18:18', 10, 3),
(28, '冰河奇遇券', 'WGT4isGqECke', '2025-02-28', '2025-03-20', 300, 2500, '2025-02-27 18:18:37', 30, 1),
(29, '冰河奇遇券', 'nqmxald2Ilc4', '2025-03-07', '2025-03-20', 350, 2500, '2025-02-27 18:18:56', 15, 3),
(30, '極限冰封券', 'D5c1rHXu2m4j', '2025-02-28', '2025-03-12', 50, 3000, '2025-02-27 18:19:22', 18, 2);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `coupon`
--
ALTER TABLE `coupon`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `coupon`
--
ALTER TABLE `coupon`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
