-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2025-03-03 08:59:06
-- 伺服器版本： 10.4.32-MariaDB
-- PHP 版本： 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `daiski_db`
--

-- --------------------------------------------------------

--
-- 資料表結構 `locations`
--

CREATE TABLE `locations` (
  `id` int(11) NOT NULL COMMENT '地點 ID',
  `name` varchar(255) NOT NULL COMMENT '地點名稱',
  `address` varchar(255) NOT NULL COMMENT '地址',
  `city` varchar(100) NOT NULL COMMENT '城市',
  `country` varchar(100) NOT NULL COMMENT '國家',
  `latitude` decimal(20,17) NOT NULL COMMENT '緯度',
  `longitude` decimal(20,17) NOT NULL COMMENT '經度',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp() COMMENT '建立時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='存儲滑雪課程的上課地點資訊';

--
-- 傾印資料表的資料 `locations`
--

INSERT INTO `locations` (`id`, `name`, `address`, `city`, `country`, `latitude`, `longitude`, `created_at`) VALUES
(1, '富良野滑雪場', '076-8511北海道富良野市中御料', '北海道', '日本', 43.32513289734520000, 142.35330272587458000, '2025-02-21 04:25:12'),
(2, 'Sahoro滑雪場', '081-0039 上川郡新得町狩胜高原', '北海道', '日本', 43.17480866330945600, 142.80781506746217000, '2025-02-24 08:25:46'),
(3, '二世谷 Moiwa滑雪場', '048-1511 北海道虻田郡ニセコ町ニセコ448', '北海道', '日本', 42.84823376371926000, 140.63026315582076000, '2025-02-24 08:29:26'),
(4, '二世谷聯合 (Annupuri)滑雪場', '北海道虻田郡ニセコ町字ニセコ485', '北海道', '日本', 42.84736934159206400, 140.64818663438880000, '2025-02-24 08:33:42'),
(5, '二世谷聯合 (Grand HIRAFU)滑雪場', '044-0081 北海道虻田郡倶知安町字山田204', '北海道', '日本', 42.86458988550375400, 140.70132930185096000, '2025-02-24 08:36:34'),
(6, '夕張滑雪場', '068-0411 北海道夕張市末廣2-4', '北海道', '日本', 43.05151412001746500, 141.96978128041900000, '2025-02-24 08:36:34'),
(7, '小樽天狗山滑雪場', '小樽市最上2-16-15', '北海道', '日本', 43.17772545770364400, 140.97524009999998000, '2025-02-24 08:43:18'),
(8, '札幌 手稻滑雪場', '北海道札幌市手稻區手稻本町593', '北海道', '日本', 43.07713840393250000, 141.19998851163984000, '2025-02-24 08:43:18'),
(9, '札幌 札幌國際滑雪場', '札幌市南區定山溪937番地先', '北海道', '日本', 43.07235850583783000, 141.08282541213450000, '2025-02-24 08:44:29'),
(10, '札幌 盤溪滑雪場', '札幌市中央區盤溪410', '北海道', '日本', 43.03059896937568000, 141.27829563439238000, '2025-02-24 08:46:40'),
(11, '札幌 藻岩山滑雪場', '北海道札幌市南区藻岩山下1991', '北海道', '日本', 43.01251316473022000, 141.33354073809662000, '2025-02-24 08:46:40'),
(12, '星野 Tomamu滑雪場', '北海道勇払郡占冠村中トマム', '北海道', '日本', 43.06938643940320000, 142.61559478598090000, '2025-02-24 08:49:44'),
(13, '神居滑雪場', '北海道旭川市神居町西丘112', '北海道', '日本', 43.70507558324677400, 142.18710199999998000, '2025-02-24 08:49:44'),
(14, '雫石王子滑雪場', '日本岩手縣岩手郡雫石町高倉溫泉', '東北', '日本', 39.77382681564244400, 140.92441507380640000, '2025-02-24 08:52:28'),
(15, 'Grandeco滑雪場', '福島縣耶麻郡北鹽原村檜原荒砂澤山', '東北', '日本', 37.69564603061974000, 140.13269117116397000, '2025-02-24 08:52:28'),
(16, '八甲田滑雪場', '青森縣青森市大字荒川字寒水澤', '東北', '日本', 40.67954820876121000, 140.83261931016010000, '2025-02-24 08:56:26'),
(17, '八幡平滑雪場', '岩手縣八幡平市松尾陽木1-509-1', '東北', '日本', 39.89990712091654500, 140.97709801376270000, '2025-02-24 08:56:26'),
(18, '安比高原', '岩手縣八幡平市安比高原', '東北', '日本', 40.01276867577444600, 140.99739730185212000, '2025-02-24 09:05:36'),
(19, '青森之泉', '青森県西津軽郡鯵ヶ沢町鯵ヶ沢高原', '東北', '日本', 40.69329885753245400, 140.27950384455318000, '2025-02-24 09:05:36'),
(20, '星野貓魔山', '福島縣耶麻郡北鹽原村大字檜原字貓魔山1163', '東北', '日本', 37.62735091661054600, 140.03806282720876000, '2025-02-24 09:12:23'),
(21, '夏油高原滑雪場', '岩手県北上市和賀町岩崎新田国有林内', '東北', '日本', 39.23676584008348000, 140.90632527102700000, '2025-02-24 09:12:23'),
(22, '宮城藏王 白石滑雪場', '宮城縣白石市福岡八宮字不忘山無番地', '東北', '日本', 38.06861608180338000, 140.51328222496213000, '2025-02-24 09:20:51'),
(23, '宮城藏王 烏帽子滑雪場', '宮城縣刈田郡藏王町遠刈田溫泉倉石岳國有林內', '東北', '日本', 38.12904408198310000, 140.52828062509764000, '2025-02-24 09:20:51'),
(24, '妙高 滑雪場', '新潟縣妙高市杉之澤市', '新潟', '日本', 36.85704265550416000, 138.15509145415700000, '2025-02-24 09:25:52'),
(25, '邱比特滑雪場', '新潟縣上越市安塚區須川4820', '新潟', '日本', 37.05520624427350600, 138.48452545767202000, '2025-02-24 09:25:52'),
(26, '苗場', '新潟縣南魚沼郡湯澤町三國市949-6292', '新潟', '日本', 36.79179914504338500, 138.78001600926060000, '2025-02-24 09:29:26'),
(27, '神樂', '949-6211新潟縣南魚沼郡湯澤町三俁742', '新潟', '日本', 36.85998974703106000, 138.72695191111270000, '2025-02-24 09:29:26'),
(28, '越後湯澤 NASPA 新大谷滑雪場', '新潟縣南魚沼郡湯澤町湯澤2117-9', '新潟', '日本', 36.92696502878832400, 138.80897273881615000, '2025-02-24 09:39:22'),
(29, '越後湯澤 上越國際滑雪場', '新潟縣南魚沼市樺野澤112番地1號', '新潟', '日本', 37.03347032266561500, 138.81952205952413000, '2025-02-24 09:39:22'),
(30, '越後湯澤 石打丸山滑雪場', '新潟縣南魚沼市石打1655', '新潟', '日本', 36.97946339049734000, 138.80275503254023000, '2025-02-24 09:45:40'),
(31, '越後湯澤 岩原滑雪場', '新潟縣南魚沼郡湯澤町大字土樽731-79', '新潟', '日本', 36.93838623371265000, 138.84090332275252000, '2025-02-24 09:45:40'),
(32, '越後湯澤 神立高原滑雪場', '新潟縣南魚沼郡湯澤町神立4121-1', '新潟', '日本', 36.91126306857200000, 138.81282242883603000, '2025-02-24 09:45:40'),
(33, '越後湯澤 湯澤中里滑雪場', '新潟縣南魚沼郡湯澤町土樽5044-1', '新潟', '日本', 36.91440321377976400, 138.84873987141700000, '2025-02-24 09:45:40'),
(34, '越後湯澤 舞子高原滑雪場', '949-6423 新潟縣南魚沼市舞子2056-108', '新潟', '日本', 36.98294912756037000, 138.82497792678490000, '2025-02-24 09:45:40');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `locations`
--
ALTER TABLE `locations`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `locations`
--
ALTER TABLE `locations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '地點 ID', AUTO_INCREMENT=35;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
